# 1. Используем Node.js как базовый образ
FROM node:18-alpine

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# 4. Устанавливаем зависимости
RUN npm install

# 5. Копируем весь проект в контейнер
COPY . .

# 6. Строим проект для продакшена
RUN npm run build

# 7. Указываем порт, на котором приложение будет слушать (по умолчанию 3000)
EXPOSE 3000

# 8. Устанавливаем команду для запуска приложения
CMD ["npm", "start"]
